src/InformationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/Запасы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>Запасы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоррСтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСпецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатратыНаВыпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеВРозницуСуммовойУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ОстаткиТоваров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиЗаписи
	
// Производит запись в служебный регистр сведений данных по остатками и резервам номенклатуры
//
Процедура РассчитатьОстатокТовараДляБыстрогоОтображения(ДополнительныеСвойства, ЧислоДвижений, ИмяТаблицыЗапасы = "ДвиженияЗапасыНаСкладахИзменение") Экспорт
	
	Если НЕ ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы[ИмяТаблицыЗапасы] Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
	Запрос.Текст = ТекстЗапросаОстатки();
	
	Если НЕ ИмяТаблицыЗапасы = "ДвиженияЗапасыНаСкладахИзменение" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДвиженияЗапасыНаСкладахИзменение", ИмяТаблицыЗапасы)
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборЗаписей = РегистрыСведений.ОстаткиТоваров.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Номенклатура) Тогда Продолжить КонецЕсли;
		
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(Выборка.СтруктурнаяЕдиница);
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		НаборЗаписей.Отбор.Характеристика.Установить(Выборка.Характеристика);
		НаборЗаписей.Отбор.Партия.Установить(Выборка.Партия);
		
		НовСтр = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		НовСтр.Количество = НовСтр.Количество - НовСтр.Резерв;
		
		Если НовСтр.Количество = 0 И НовСтр.Резерв = 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		НаборЗаписей.Очистить();
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаОстатки()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
	|	ДвиженияЗапасыНаСкладахИзменение.Организация КАК Организация,
	|	ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК Характеристика,
	|	ДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия
	|ПОМЕСТИТЬ ВТДвиженияЗапасыНаСкладахИзменение
	|ИЗ
	|	ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияЗапасыНаСкладахИзменение.Организация,
	|	ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница,
	|	ДвиженияЗапасыНаСкладахИзменение.Партия,
	|	ДвиженияЗапасыНаСкладахИзменение.Характеристика,
	|	ДвиженияЗапасыНаСкладахИзменение.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
	|	ВТДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТДвиженияЗапасыНаСкладахИзменение.Организация КАК Организация,
	|	ВТДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия,
	|	ВТДвиженияЗапасыНаСкладахИзменение.Характеристика КАК Характеристика,
	|	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0)) КАК КоличествоФинКонтур,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВтФинКонтур
	|ИЗ
	|	ВТДвиженияЗапасыНаСкладахИзменение КАК ВТДвиженияЗапасыНаСкладахИзменение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
	|				,
	|				(Номенклатура, Организация, СтруктурнаяЕдиница, Характеристика, Партия) В
	|					(ВЫБРАТЬ
	|						ВТДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
	|						ВТДвиженияЗапасыНаСкладахИзменение.Организация КАК Организация,
	|						ВТДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|						ВТДвиженияЗапасыНаСкладахИзменение.Характеристика КАК Характеристика,
	|						ВТДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия
	|					ИЗ
	|						ВТДвиженияЗапасыНаСкладахИзменение КАК ВТДвиженияЗапасыНаСкладахИзменение)) КАК ЗапасыОстатки
	|		ПО ВТДвиженияЗапасыНаСкладахИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
	|			И ВТДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
	|			И ВТДвиженияЗапасыНаСкладахИзменение.Организация = ЗапасыОстатки.Организация
	|			И ВТДвиженияЗапасыНаСкладахИзменение.Партия = ЗапасыОстатки.Партия
	|			И ВТДвиженияЗапасыНаСкладахИзменение.Характеристика = ЗапасыОстатки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДвиженияЗапасыНаСкладахИзменение.Номенклатура,
	|	ВТДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница,
	|	ВТДвиженияЗапасыНаСкладахИзменение.Организация,
	|	ВТДвиженияЗапасыНаСкладахИзменение.Характеристика,
	|	ВТДвиженияЗапасыНаСкладахИзменение.Партия,
	|	ЗапасыОстатки.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтФинКонтур.Номенклатура КАК Номенклатура,
	|	ВтФинКонтур.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВтФинКонтур.Организация КАК Организация,
	|	ВтФинКонтур.Партия КАК Партия,
	|	ВтФинКонтур.Характеристика КАК Характеристика,
	|	СУММА(ЕСТЬNULL(ВтФинКонтур.КоличествоФинКонтур, 0)) КАК КоличествоФинКонтурРезерв
	|ПОМЕСТИТЬ ВтФинКонтурРезерв
	|ИЗ
	|	ВтФинКонтур КАК ВтФинКонтур
	|ГДЕ
	|	НЕ ВтФинКонтур.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтФинКонтур.Номенклатура,
	|	ВтФинКонтур.СтруктурнаяЕдиница,
	|	ВтФинКонтур.Организация,
	|	ВтФинКонтур.Партия,
	|	ВтФинКонтур.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
	|	ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДвиженияЗапасыНаСкладахИзменение.Организация КАК Организация,
	|	ДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия,
	|	ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК Характеристика,
	|	СУММА(ВтФинКонтур.КоличествоФинКонтур) КАК Количество,
	|	ВтФинКонтурРезерв.КоличествоФинКонтурРезерв КАК Резерв
	|ИЗ
	|	ВТДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтФинКонтур КАК ВтФинКонтур
	|		ПО ДвиженияЗапасыНаСкладахИзменение.Номенклатура = ВтФинКонтур.Номенклатура
	|			И ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница = ВтФинКонтур.СтруктурнаяЕдиница
	|			И ДвиженияЗапасыНаСкладахИзменение.Организация = ВтФинКонтур.Организация
	|			И ДвиженияЗапасыНаСкладахИзменение.Партия = ВтФинКонтур.Партия
	|			И ДвиженияЗапасыНаСкладахИзменение.Характеристика = ВтФинКонтур.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтФинКонтурРезерв КАК ВтФинКонтурРезерв
	|		ПО ДвиженияЗапасыНаСкладахИзменение.Номенклатура = ВтФинКонтурРезерв.Номенклатура
	|			И ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница = ВтФинКонтурРезерв.СтруктурнаяЕдиница
	|			И ДвиженияЗапасыНаСкладахИзменение.Организация = ВтФинКонтурРезерв.Организация
	|			И ДвиженияЗапасыНаСкладахИзменение.Партия = ВтФинКонтурРезерв.Партия
	|			И ДвиженияЗапасыНаСкладахИзменение.Характеристика = ВтФинКонтурРезерв.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияЗапасыНаСкладахИзменение.Номенклатура,
	|	ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница,
	|	ДвиженияЗапасыНаСкладахИзменение.Организация,
	|	ДвиженияЗапасыНаСкладахИзменение.Характеристика,
	|	ДвиженияЗапасыНаСкладахИзменение.Партия,
	|	ВтФинКонтурРезерв.КоличествоФинКонтурРезерв";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Производит запись в служебный регистр сведений данных по всем остатками и резервам номенклатуры
//
Функция ВыполнитьЗаданиеПоЗаписиОстатковВТехническийРегистр() Экспорт
	
	НаборЗаписей = РегистрыСведений.ОстаткиТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОстаткиТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗапасыОстатки.Организация КАК Организация,
		|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.Партия КАК Партия,
		|	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0)) КАК Резерв,
		|	СУММА(0) КАК Количество
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|				И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.Характеристика,
		|	ЗапасыОстатки.Партия,
		|	ЗапасыОстатки.СтруктурнаяЕдиница,
		|	ЗапасыОстатки.Организация,
		|	ЗапасыОстатки.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Организация,
		|	ЗапасыОстатки.СтруктурнаяЕдиница,
		|	ЗапасыОстатки.Номенклатура,
		|	ЗапасыОстатки.Характеристика,
		|	ЗапасыОстатки.Партия,
		|	СУММА(0),
		|	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0))
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|				И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.СтруктурнаяЕдиница,
		|	ЗапасыОстатки.Партия,
		|	ЗапасыОстатки.Характеристика,
		|	ЗапасыОстатки.Организация,
		|	ЗапасыОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Организация КАК Организация,
		|	Итог.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Итог.Номенклатура КАК Номенклатура,
		|	Итог.Характеристика КАК Характеристика,
		|	Итог.Партия КАК Партия,
		|	СУММА(Итог.Резерв) КАК Резерв,
		|	СУММА(Итог.Количество) КАК Количество
		|ИЗ
		|	Итог КАК Итог
		|ГДЕ
		|	НЕ Итог.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(Итог.СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
		|
		|СГРУППИРОВАТЬ ПО
		|	Итог.Характеристика,
		|	Итог.Организация,
		|	Итог.Номенклатура,
		|	Итог.Партия,
		|	Итог.СтруктурнаяЕдиница
		|ИТОГИ ПО
		|	Номенклатура";
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если Не Выборка.Количество() Тогда
			ОтменитьТранзакцию();
			Возврат Истина 
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ОстаткиТоваров.СоздатьНаборЗаписей();
		
		Пока Выборка.Следующий() Цикл
			
			ВыборкаДетали = Выборка.Выбрать();
			
			НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
			
			Пока ВыборкаДетали.Следующий() Цикл
				НовСтр = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетали);
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			НаборЗаписей.Очистить();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

// Производит пересчет записи в служебном регистре сведений данных по номенклатуре
//
Функция ВыполнитьЗаданиеПоПересчетуОстатковВТехническомРегистре(Номенклатура) Экспорт
	
	НаборЗаписей = РегистрыСведений.ОстаткиТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	НаборЗаписей.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОстаткиТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗапасыОстатки.Организация КАК Организация,
		|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.Партия КАК Партия,
		|	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0)) КАК Резерв,
		|	СУММА(0) КАК Количество
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|				И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.Характеристика,
		|	ЗапасыОстатки.Партия,
		|	ЗапасыОстатки.СтруктурнаяЕдиница,
		|	ЗапасыОстатки.Организация,
		|	ЗапасыОстатки.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Организация,
		|	ЗапасыОстатки.СтруктурнаяЕдиница,
		|	ЗапасыОстатки.Номенклатура,
		|	ЗапасыОстатки.Характеристика,
		|	ЗапасыОстатки.Партия,
		|	СУММА(0),
		|	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0))
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|				И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.СтруктурнаяЕдиница,
		|	ЗапасыОстатки.Партия,
		|	ЗапасыОстатки.Характеристика,
		|	ЗапасыОстатки.Организация,
		|	ЗапасыОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Организация КАК Организация,
		|	Итог.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Итог.Номенклатура КАК Номенклатура,
		|	Итог.Характеристика КАК Характеристика,
		|	Итог.Партия КАК Партия,
		|	СУММА(Итог.Резерв) КАК Резерв,
		|	СУММА(Итог.Количество) КАК Количество
		|ИЗ
		|	Итог КАК Итог
		|ГДЕ
		|	НЕ Итог.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(Итог.СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
		|
		|СГРУППИРОВАТЬ ПО
		|	Итог.Характеристика,
		|	Итог.Организация,
		|	Итог.Номенклатура,
		|	Итог.Партия,
		|	Итог.СтруктурнаяЕдиница
		|ИТОГИ ПО
		|	Номенклатура";
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если Не Выборка.Количество() Тогда
			ОтменитьТранзакцию();
			Возврат Истина 
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ОстаткиТоваров.СоздатьНаборЗаписей();
		
		Пока Выборка.Следующий() Цикл
			
			ВыборкаДетали = Выборка.Выбрать();
			
			НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
			
			Пока ВыборкаДетали.Следующий() Цикл
				НовСтр = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетали);
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			НаборЗаписей.Очистить();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

// Обновляет остатки и резервы номенклатуры в служебном регистре
//
Функция ОбновитьЗаписиОстатковВТехническомРегистре(ДополнительныеПараметры = Неопределено) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОстаткиТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЕстьОтборПоНоменклатуре = Ложь;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ТаблицаНоменклатуры") Тогда
			ЭлементБлокировки.ИсточникДанных = ДополнительныеПараметры.ТаблицаНоменклатуры;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			ЕстьОтборПоНоменклатуре = Истина;
		Иначе
			НаборЗаписей = РегистрыСведений.ОстаткиТоваров.СоздатьНаборЗаписей();
			НаборЗаписей.Записать();
		КонецЕсли;
	Иначе
		НаборЗаписей = РегистрыСведений.ОстаткиТоваров.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗапасыОстатки.Организация КАК Организация,
		|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.Партия КАК Партия,
		|	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0)) КАК Резерв,
		|	СУММА(0) КАК Количество
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|				И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
		|				И Номенклатура В (&ТаблицаНоменклатуры)) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.Характеристика,
		|	ЗапасыОстатки.Партия,
		|	ЗапасыОстатки.СтруктурнаяЕдиница,
		|	ЗапасыОстатки.Организация,
		|	ЗапасыОстатки.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Организация,
		|	ЗапасыОстатки.СтруктурнаяЕдиница,
		|	ЗапасыОстатки.Номенклатура,
		|	ЗапасыОстатки.Характеристика,
		|	ЗапасыОстатки.Партия,
		|	СУММА(0),
		|	СУММА(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0))
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|				И ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
		|				И Номенклатура В (&ТаблицаНоменклатуры)) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.СтруктурнаяЕдиница,
		|	ЗапасыОстатки.Партия,
		|	ЗапасыОстатки.Характеристика,
		|	ЗапасыОстатки.Организация,
		|	ЗапасыОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Организация КАК Организация,
		|	Итог.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Итог.Номенклатура КАК Номенклатура,
		|	Итог.Характеристика КАК Характеристика,
		|	Итог.Партия КАК Партия,
		|	СУММА(Итог.Резерв) КАК Резерв,
		|	СУММА(Итог.Количество) КАК Количество
		|ИЗ
		|	Итог КАК Итог
		|ГДЕ
		|	НЕ Итог.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И ТИПЗНАЧЕНИЯ(Итог.СтруктурнаяЕдиница) = ТИП(Справочник.СтруктурныеЕдиницы)
		|
		|СГРУППИРОВАТЬ ПО
		|	Итог.Характеристика,
		|	Итог.Организация,
		|	Итог.Номенклатура,
		|	Итог.Партия,
		|	Итог.СтруктурнаяЕдиница
		|ИТОГИ ПО
		|	Номенклатура";
		
		Если ЕстьОтборПоНоменклатуре Тогда
			Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ДополнительныеПараметры.ТаблицаНоменклатуры);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Номенклатура В (&ТаблицаНоменклатуры)", "");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если Не Выборка.Количество() Тогда
			ОтменитьТранзакцию();
			Возврат Истина 
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ОстаткиТоваров.СоздатьНаборЗаписей();
		
		Пока Выборка.Следующий() Цикл
			
			ВыборкаДетали = Выборка.Выбрать();
			
			НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
			НаборЗаписей.Очистить();
			
			Пока ВыборкаДетали.Следующий() Цикл
				НовСтр = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетали);
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			НаборЗаписей.Очистить();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
